[{"title":"Is a Career in Tech Recession-Proof?","date":"Aug 12, 2022","category":"Cloud Administration","content":"Given the current economic climate, many economists are considering the U.S. to be entering a recession. This can cause confusion, fear, and uncertainty, especially as it pertains to job security. To ease some of those feelings, below you’ll find some careers in tech that tend to hold up better than others amid a recession. In the event of a recession, companies will likely shift to digital strategies, making these careers in tech valuable and highly coveted.     Programmer\/Developer No matter the programming language you’ve mastered, having the knowledge alone makes you extremely valuable. The coding skills you possess as a programmer or developer are in-demand for companies looking to build or enhance their websites, and enhance their consumer experience. According to the U.S. Bureau of Labor Statistics, jobs in software development are expected to grow 22% by 2030. This is much faster than the average career.      Cloud Administrator More businesses are transitioning to cloud servers and this increase sparks the need for cloud administrators to maintain and update the cloud infrastructure. Amid a recession, it is likely that efforts regarding security will be heightened as company strategies shift digitally, and managing a more secure server will be the responsibility of the cloud administrator.      Data Analyst During a recession, the need to preserve and monitor data, as well as use data to make predictions to drive a business’ initiatives will be heightened. Data analysts would be relied on heavily to study the data presented and interpret it to solve any current or future problems.  The three positions mentioned above can all be obtained after you complete one of our bootcamps, and take as little as 15 to 20 weeks to complete. Upon successful completion, if you do not land a job in-field within 6 months of graduating from a Codeup program, we will refund your paid tuition back to you.*   Codeup Programs Codeup is a Texas-based career accelerator, built to help you transition to a career in tech seamlessly, and be well-equipped to succeed in your new role. We offer three different programs: Full-Stack Web Development, Cloud Administration, and Data Science. You can learn more about each of them here or by requesting more information on any that may interest you. If you have any hesitation about changing your career, or about any of our programs please reach out to us. We would love to help you find the program that best suits your needs and interests. Give us a call today at (210) 802- 7289. *See tuition refund details and specifications here."},{"title":"Codeup X Superhero Car Show & Comic Con","date":"Aug 10, 2022","category":"Codeup News","content":"Codeup had a blast at the San Antonio Superhero Car Show and Comic Con! We had a booth for the all four days of the event, and we got to chat with some great people about Codeup’s offerings, as well as spread the word about our Lego set giveaway (winners announced on our social media accounts and below)! We would like to extend a huge thank you to PMX events, attendees, and volunteers who helped make this event a big success.  Winners of the Lego set giveaway:  Congratulations! Thank you for participating! Check out some great pics below!                            Check out more upcoming events in San Antonio, and if you’re interested in learning more about Codeup check out our program offerings, we would love to help you jumpstart your career in tech. When you’re ready, start the process by filling out a quick form found here."},{"title":"What Jobs Can You Get After a Coding Bootcamp? Part 3: Web Development","date":"Aug 2, 2022","category":"Featured","content":"If you’re considering a career in web development, but don’t know what to expect, continue reading and we will help you find out! In this mini-series, we will take each of our programs here at Codeup: Data Science, Web Development, and Cloud Administration, and outline respectively potential job titles, as well as entry-level salaries.* Today we will be discussing our Full-Stack Web Development program. Program Overview Our Web Development program is 20 weeks of training in one of the most in-demand fields in the country. Upon completing this program you will have created an app or website from scratch, and have received hours of hands-on training from industry experts to equip you with the tools and knowledge to successfully enter your new career. Potential Jobs   1. Full-Stack Web Developer A Full-Stack Web Developer is proficient in both front and back-end coding as it pertains to apps, software, and websites. These developers have a good understanding of different coding languages and are capable of building websites that can handle heavy content and still function seamlessly. An entry-level full-stack developer can make an estimated $67,535 according to Glassdoor. 2. Software Developer A Software Developer is responsible for programming, building, executing, and maintaining the software and programming they designed. An entry-level software developer can make an estimated $74,407 according to Glassdoor. 3. Computer Programmer A Computer Programmer ensures that all aspects of specific software, website, and application are functioning properly. This is accomplished by writing and testing code as well as making adjustments where necessary. An entry-level computer programmer can make an estimated $57,939 according to Glassdoor.  Honorable Mention A couple of additional roles to consider upon completing our Web Development program include:  Front-End Software Developer: Estimated Entry-Level Salary $75,091 Application Development Analyst: Estimated Entry-Level Salary $67,460  Interested in the other parts of this mini-series? Check them out below! Part 1: Data Science Part 2: Cloud Administration *Disclaimer: All information presented in this article is by no means guaranteed by completing a Codeup program. Salaries and duties vary based on factors such as company, location, and experience. These salaries are estimates based on San Antonio, TX data, and these duties are general and may not be exact for every position."},{"title":"Codeup’s New Dallas Campus","date":"Jul 25, 2022","category":"Codeup News","content":"Codeup’s Dallas campus has a new location! For more than two years, Codeup has been operating out of our original building on Commerce st. in Dallas, but recently Codeup has moved, and tripled our campus space! Our new address is 900 Jackson Street Suite #400 Dallas, Tx 75202  Codeup has been a leading coding boot camp in Texas for more than eight years, with active campuses in San Antonio and Dallas offering accelerated programs in Data Science, Cloud Administration, and Full-Stack Web Development. Dallas Tech Scene With Dallas’ tech scene booming, it is imperative that the appropriate talent is available! We help produce top talent at a fast pace to keep up with the demand for tech jobs in the community. Codeup Dallas Offerings Currently, Codeup offers a 20-week Full-Stack Web Development program at our Dallas location with hopes to add our other programs in the future. Dallas Campus Area Located in the heart of Downtown Dallas, our new location is surrounded by great restaurants, museums, monuments and statues!  John F. Kennedy Memorial Plaza Dealey Plaza Civic Garden AT&T Discovery District Museum of Illusions Dallas Holocaust and Human Rights Museum Dallas World Aquarium Reunion Tower NOLA Brasserie Twisted Trompo Taco Restaurant Family Thais Asian Bistro Y.O. Ranch Steakhouse  Codeup would love to help you jumpstart your career in tech, whether it be at our new Dallas campus, or one of our San Antonio locations, if you’re ready to transition into a career in Web Development, Data Science or Cloud Administration, we would love to help. Visit us here to apply today or give us a call at (210) 802-7289 to discuss your options."},{"title":"Codeup TV Commercial","date":"Jul 20, 2022","category":"Codeup News","content":"Codeup has officially made its TV debut! Our community of students, staff and CEO gathered to create the first-ever Codeup TV Commercial! Check it out to get a rundown of our offerings, and take a peek into our downtown Vogue campus where the commercial was filmed. View the Codeup TV commercial below to see what the hype is about!  Check out some behind-the-scenes of filming:             Codeup would love to help you jumpstart your career in tech. If you’re interested in learning more, check out our program offerings. When you’re ready, start the process by filling out a quick form found here.  “COME JOIN US!”"},{"title":"What Jobs Can You Get After a Coding Bootcamp? Part 2: Cloud Administration","date":"Jul 14, 2022","category":"Featured","content":"Have you been considering a career in Cloud Administration, but have no idea what your job title or potential salary could be? Continue reading below to find out! In this mini-series, we will take each of our programs here at Codeup: Data Science, Web Development, and Cloud Administration, and outline respectively potential job titles, as well as entry-level salaries.* Let’s discuss Cloud Administration. Program Overview At Codeup, we offer a 15-week Cloud Administration program, which was derived from our previous two programs: Systems Engineering and Cyber Cloud. We combined the best of both and blended hands-on practical knowledge with skilled instructors to create the Cloud Administration program. Upon completing this program, you’ll have the opportunity to take on two exams for certifications: Amazon Web Services (AWS) Cloud Practitioner and AWS Solutions Architect Associate.  Potential Jobs According to A Cloud Guru, with an AWS Certification you’ll be equipped with the knowledge and experience to secure a job as the following: 1. Cloud Architect As a Cloud Architect, you will double as an IT specialist responsible for your organization’s cloud infrastructure. This includes system monitoring, computing strategy, planning, building and deployment. An entry-level Cloud Architect can make an estimated $93,892 annually according to Glassdoor.  2. Cloud Developer A Cloud Developer’s main duties align with a software developer’s. The differentiating factor is a Cloud Developer operates virtually with cloud computing technology. This may include the design, analysis and maintenance of a company’s cloud infrastructure. An entry-level Cloud Developer can make an estimated $89,652 annually according to Glassdoor.  3. Cloud Systems Administrator A Cloud Systems Administrator can be expected to provide insight on cloud systems, specifically working with IT to provide assistance and resolve operational issues. An entry-level Cloud Systems Administrator can make an estimated $64,805 annually according to Glassdoor. Honorable Mention A few additional roles to consider with AWS Certification include:   Cloud DevOps Engineer- Estimated Entry-Level Salary $88,563 Cloud Security Engineer- Estimated Entry-Level Salary $85,111 Cloud Data Architect- Estimated Entry-Level Salary $91,598 Cloud Consultant- Estimated Entry-Level Salary $72,474  Interested in the other parts of this mini-series? Check them out below!  Part 1: Data Science Part 3: Web Development (Coming Soon!)   *Disclaimer: All information presented in this article is by no means guaranteed by completing a Codeup program. Salaries and duties vary based on factors such as company, location, and experience. These salaries are estimates based on San Antonio, TX data, and these duties are general and may not be exact for every position."}]